src/Catalogs/СостояниеЗубнойФормулы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СостояниеЗубнойФормулы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбластьЗубнойФормулы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбластиЗубнойФормулы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловноеОбозначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/СостояниеЗубнойФормулы/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если  ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	
	Макет = ПолучитьОбщийМакет("SVGСправочник").ПолучитьТекст();
	HTML  = ПолучитьОбщийМакет("HTMLДокумент").ПолучитьТекст();
	ВыделенныйЭлементЗуба = "var idClickedElement;";
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриОткрытии"
//
Процедура ПриОткрытии(Отказ)
	
	ОбновитьДокумент();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура, выполняет установку условного оформления
//
Процедура УстановитьУсловноеОформление()
	
	ЭтаФорма.УсловноеОформление.Элементы.Очистить();
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	                      |	СостояниеЗубнойФормулы.Цвет
	                      |ИЗ
	                      |	Справочник.СостояниеЗубнойФормулы КАК СостояниеЗубнойФормулы");
	Результат = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТЧ из Результат Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Цвет) Тогда
			НоваяСтрока = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
			НоваяСтрока.Использование = Истина;
			Попытка
				НоваяСтрока.Оформление.УстановитьЗначениеПараметра("ЦветФона",ОбщегоНазначенияКлиентСерверСтоматология.ПолучитьЦветRGB(СтрокаТЧ.Цвет));
			Исключение
			КонецПопытки;
			ЭлементУсловия = НоваяСтрока.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Цвет");
			ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементУсловия.ПравоеЗначение = СтрокаТЧ.Цвет;					
			мПоля = НоваяСтрока.Поля.Элементы.Добавить();
			мПоля.Поле = Новый ПолеКомпоновкиДанных("Список");
		КонецЕсли;		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обновляет картинку подбора зубов
//
Процедура ОбновитьДокумент()
	
	Если ЗначениеЗаполнено(Области) Тогда
	     мВыделенныйЭлементЗуба = "var idClickedElement = '" + Строка(Области)+"';";
		 Макет = СтрЗаменить(Макет, ВыделенныйЭлементЗуба, мВыделенныйЭлементЗуба);
		 ВыделенныйЭлементЗуба = мВыделенныйЭлементЗуба;
	КонецЕсли;
		
	HTMLДокумент = СтрЗаменить(HTML, "SVGElement", Макет);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриНажатии"
//
Процедура HTMLДокументПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ДанныеСобытия.Element.id) Тогда					
		ОбработатьВыбор(ДанныеСобытия.Element.id);						
	КонецЕсли;					
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет обработку нажатия HTMLдокумента
//
Процедура ОбработатьВыбор(Выбор)
	
	Если Выбор = "Layer_1" Тогда		
		Области = Неопределено;
	Иначе
		Области = ПредопределенноеЗначение("Перечисление.ОбластиЗубнойФормулы."+Выбор+"");		
	КонецЕсли;
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "ОбластьЗубнойФормулы", Области, ЗначениеЗаполнено(Области));
	Элементы.Список.ТекущаяСтрока = Неопределено;  	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура ОбластиПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "ОбластьЗубнойФормулы", Области, ЗначениеЗаполнено(Области));
	ОбновитьДокумент();
	Элементы.Список.ТекущаяСтрока = Неопределено;
		
КонецПроцедуры
           
&НаКлиенте
// Процедура, обаботчик события "ОбработкаОповещения"  
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСписок" Тогда
		УстановитьУсловноеОформление();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриАктивизацииПоля"
//
Процедура СписокПриАктивизацииПоля(Элемент)
	Элементы.Список.ТекущаяСтрока = Неопределено;	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриАктивизацииЯчейки"
//
Процедура СписокПриАктивизацииЯчейки(Элемент)
	Элементы.Список.ТекущаяСтрока = Неопределено;
КонецПроцедуры

#КонецОбласти
